#GIT - распрастраненная система контроля версии
# это система для отслеживания и ведения истории изменения файлом в вашем проекте 

# РЕПОЗИТОРИИ  - это хранилище вашего кода и истории его изменения 
# GITHUB - веб сайт для размещения гит репозиториев и совместной разработки проектов



# КОМАНДЫ ГИТА
# 1 git init - она создает новвый гит репощиторий локально на вашем пк

# 2 git commit - как только мы достигаем определенного момента в разработке то тогда 
# мы сохраняем и комментриуем изменения(фиксация изменений в репо)

# git commit - m '<comment'   № комментарии
# 3  git add - когда мы создаем или изменяем файлы то при помощи этой команды мы загружаем все изменения в локальное 
# хранилище 

# git add <nameoffile> 
# git add.  добавить все что находится внутри 

# 4git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием (репо в гитхаб%)

# git remote add <названия подключения> <<ссылка на репо>>
# git remote add origin <url>

#5 git push - после коммита изменений при помощи команды мы отправляем наши изменения на удаленный репозиторий
# git push <name vetki>

#>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
#6. git branch ветки очень важны в гит при помощи веток несколько прошраммистов могут работать парралельно на одном и том 
# же проекте При помощи команды git branch мы можем создавать просматривать или удалять ветки
# СОЗДАНИЯ ВЕТКИ git branch <namevetki> 
#  просмотр ветки git branch or git branch list
#  удаление ветки git branch -d <namevetki>

#7 git checkout - используется при работе в команде помогает переключаться по веткам

# get checkout <namevetki> #название ветки

strochka vetki izzat 