#GIT - распрастраненная система контроля версии
# это система для отслеживания и ведения истории изменения файлом в вашем проекте 

# РЕПОЗИТОРИИ  - это хранилище вашего кода и истории его изменения 
# GITHUB - веб сайт для размещения гит репозиториев и совместной разработки проектов



# КОМАНДЫ ГИТА
# 1 git init - она создает новвый гит репощиторий локально на вашем пк

# 2 git commit - как только мы достигаем определенного момента в разработке то тогда 
# мы сохраняем и комментриуем изменения(фиксация изменений в репо)

# git commit - m '<comment'   № комментарии
# 3  git add - когда мы создаем или изменяем файлы то при помощи этой команды мы загружаем все изменения в локальное 
# хранилище 

# git add <nameoffile> 
# git add.  добавить все что находится внутри 


